#include <locale.h>
#include <stdio.h>

int main()
{
    setlocale(LC_ALL, "RUS");
    printf("123\n");                                              // 1
    printf("1\n2\n3\n");                                         // 2
    printf("1\n\t2\n\t\t3\n");                                   // 3
    printf("%1d\n%2d\n%3d\n%4d\n", 1, 2, 3, 4);                  // 4
    printf("%10.3f\n", 12.234657);                                // 5
    printf("%10.5f\n", 12.234657);                                // 6
    printf("Остаток от деления %d на %d равен %d\n", 5, 2, 5 % 2); // 7
    printf("%d разделить на %d равно %.2f\n", 7, 5, 7.0 / 5);       // 8
    printf("%d умножить на %d равно %d\n", 2000, 4, 2000 * 4);      // 9

    printf("%g разделить %e равно %f\n", 5., 2000000., 5. / 2000000); // 10
    printf("%f разделить %f равно %f\n", 5., 2000000., 5. / 2000000);
    printf("%g разделить %g равно %g\n", 5., 2000000., 5. / 2000000);
    printf("%e разделить %e равно %e\n", 5., 2000000., 5. / 2000000);

    printf("%d разделить %d равно %d\n", 5, 2000000, 5 / 2000000);

    return 0;
}
